// [1번] 자리배치 -> 몇줄을 만들어야 될까?
// 입장객 수 = 10명
// 한 줄에 3명씩 앉음
// 자리는 몇줄?
// 입장객수 / 한줄 사람수 => 정수(소숫점 이하 없음)

// let tkfka = 10
// let wkfl = parseInt(tkfka/3)
// let skajwl = parseInt(tkfka%3)
// console.log(wkfl, skajwl)



// [2번] 구구단 출력. 
// 2 * 1 = 2   3 * 1 = 3   4 * 1 = 4   5 * 1 = 5
// 2 * 2 = 4   3 * 2 = 6   4 * 2 = 8   5 * 2 = 10
// 2 * 3 = 6   3 * 3 = 9   4 * 3 = 12  5 * 3 = 15
// 
// 2 * 9 = 18  3 * 9 = 27  4 * 9 = 36  5 * 9 = 45

 
// for(let i = 2; i <= 9; i++) {
//   for(let j =1; j <= 9; j++) {
//     document.write(`${i} * ${j} = ${i*j}`, "<br>");
//   }
//   }


// [3번] [20, 17, 45, 11, 82] 의 배열을 오름차순으로 정렬.



let qoduf = [20, 17, 45, 11, 82]
qoduf.sort();
console.log(qoduf);



